#include "dcvremya.h"
#include <QDateTime>

DCVremya::DCVremya(){//Конструктор
////////////////////////////////
//---К О Н С Т Р У К Т О-Р----//
////////////////////////////////
	m_ptmrTimer = new QTimer;//Таймер.
}

DCVremya::~DCVremya(){//Деструктор
//////////////////////////////
//---Д Е С Т Р У К Т О-Р----//
//////////////////////////////
	delete m_ptmrTimer;
	m_ptmrTimer= 0;
}

void DCVremya::run(){//Запускаем поток.
///////////////////////////////////////////////////
//---З А П У С К   П О Т О К А   В Р Е М Е Н И---//
///////////////////////////////////////////////////
	connect( 	m_ptmrTimer,
				SIGNAL(timeout()),
				this,
				SLOT(slotTimer()));//Если произошёл тайм аут, то запускаем слот Таймера.

	exec();//Запуск цикла обработки событий, чтобы работали сигналы и слоты в нутри потока.
}

void DCVremya::startTimer(){//Запуск таймера.
/////////////////////////////////////
//---З А П У С К   Т А Й М Е Р А---//
/////////////////////////////////////
	m_ptmrTimer->start(1000);//Запуск таймера с частатой 1 секунда (1000 миллисекунд)
}

void DCVremya::stopTimer(){//Остановка таймера.
///////////////////////////////////////////
//---О С Т А Н О В К А   Т А Й М Е Р А---//
///////////////////////////////////////////
	m_ptmrTimer->stop();//Останавливаем таймер.
}

void DCVremya::slotTimer(){//Слот испускает сигнал о том, что произошёл тайм аут таймера.
	emit signalTimer();//испускаем в главную программу сигнал о том, что произошёл тайм аут.
}
